# -*- coding: utf-8 -*-
# @Time    : 19-8-21 上午11:50
# @Author  : Redtree
# @File    : skills.py
# @Desc :


DATA  = {
    1:['逆向思维(主动)','每次移动后，可修改移动方向（反）'],
    2:['无敌可爱','决斗或死斗过程中','每次受到伤害结算','前百分之20概率','免疫本次伤害'],
    3:['伟大发明', '对自己造成1点伤害', '然后移动到随机位置'],
    4:['被动:幸福追求', '与怪兽决斗时', '攻击力*5'],
    5:['被动:决斗大师', '决斗或死斗中','永远先手攻击'],
    6:['被动：心眼爆破', '刺客的攻击无视','防御力'],
    7:['狙击','对战场上任意角色','造成1点伤害,行动两次','后重置技能'],
    8:['见不得光','僵尸在白天无法行动'],
    9:['血源秘法','每次行动结束后','增加自身血量1'],
    10:['隐形守护者','1 精灵无法决斗和被决斗','2 精灵触发死斗立即返回基地','3 精灵可回复任意角色2hp,','行动三次后重置'],
    11:['飞刀','屠夫使用飞刀对直线上所有角色造成2','点伤害，飞刀共两把，返回基地后重置'],
    12:['死亡诅咒','对战场上随机角色（包含自己','造成1～3点伤害'],
    13:['黑夜王者','夜晚攻击力翻倍'],
    14:['战术迂回','骑士发起决斗后，','阵营额外行动一次'],
    15:['权利庇护','国王受到任何伤害单次结算不大于1'],
    16:['天生仇恨','被动决斗时防御翻倍']
}

